Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G31B.tmx
Source language: en_us
Languages: zh_cn

source: Aristotle 384-322BC
zh_cn: 亚里斯多德 384–322BC

source: More than just a philosopher, Aristotle was a scientist, astronomer and political theorist.
zh_cn: 亚里斯多德不仅仅是一个哲学家，还是一位科学家，天文学家和政治理论家。

source: Aristotle's achievements in the history and development of western thought are both stunning and unrivalled.
zh_cn: 亚里斯多德在西方思想史上的成就是惊人而无可匹敌的。

source: More than just a philosopher, Aristotle was a scientist, astronomer, political theorist and the inventor of what is now called symbolic or formal logic.
zh_cn: 他不仅是一个哲学家，还是一位科学家、天文学家、政治理论家和符号（形式）逻辑的发明者。

source: He wrote extensively on biology, psychology, ethics, physics, metaphysics and politics and set the terms of debate in all these areas right up to modern times.
zh_cn: 他写了大量关于生物学、心理学、伦理学、物理学、形而上学和政治学的著作，并规定了在这些领域中的争议条款一直到近代。

source: Indeed, his writings on justice are still required reading for undergraduates reading Law.
zh_cn: 事实上，他关于正义的论述仍是法律本科生必读的经典作品。

source: After his death his works were lost for some 200 years or so, but fortunately were rediscovered in Crete.
zh_cn: 在亚里斯多德去世后，他的作品失传了约200年左右，但幸运的是在克里特岛被重新发现了。

source: Later translated into Latin by Boethius around 500 AD, Aristotle's influence spread throughout Syria and Islam whilst Christian Europe ignored him in favour of Plato.
zh_cn: 后来被Boethius在公元500年左右翻译成拉丁文，亚里斯多德的影响力扩散到整个叙利亚和伊斯兰地区，而当时的基督教欧洲则忽略他而支持柏拉图的思想。

source: Not until Thomas Aquinas reconciled Aristotle's work with Christian doctrine in the 13th century did he become influential in western Europe.
zh_cn: 直到13世纪时，托马斯阿奎那调和亚里斯多德的作品与基督教教义，才使他在西欧发挥影响力。

source: Aristotle received his education from age seventeen in Plato's 'Academy', where he stayed for some 20 years until Plato's death.
zh_cn: 亚里斯多德从他17岁开始在柏拉图的“学院（Academy）”中接受教育，在那里他呆了大约20年，直到柏拉图去世。

source: Later he founded his own institution, 'the Lyceum', where he would expound a philosophy altogether different both in method and content from that of his former teacher.
zh_cn: 后来，他创办了自己的学校“the Lyceum”，在那里他阐述一种哲学，在方法与内容上都与他过世的老师完全不同。

source: More than any other philosopher before him, Aristotle made much of observation and strict classification of data in his studies.
zh_cn: 亚里斯多德比在他之前的其他哲学家都更近一步，他在他的研究中做了许多的观察和严格的资料分类。

source: For this reason he is often considered as the father of empirical science and scientific method.
zh_cn: 因此，他常被认为是经验科学和科学方法之父。

source: Unlike his predecessor Plato, Aristotle always undertook his investigations by considering the regarded opinions of both experts and lay people, before detailing his own arguments, assuming that some grain of truth is likely to be found in commonly held ideas.
zh_cn: 不像他的老师柏拉图，亚里斯多德假设有些真理很可能是在普通的观念中发现，所以他总是在叙述自己的论点之前，先确保他的调查能够考虑到专家和世俗民众双方的意见。

source: Aristotle's method was nothing if not rigorous and lacked the proselytising tone of many of his predecessors.
zh_cn: 但是如果做的不够严谨，和他之前缺乏改变的前辈一般的话，亚里斯多德的方法也就没有作用了。

source: In contradistinction to both Plato and the Presocratics, Aristotle rejected the idea that the many diverse branches of human inquiry could, in principle, be subsumed under one discipline based on some universal philosophic principle.
zh_cn: 相较于柏拉图和苏格拉底以前的哲学家们，亚里斯多德驳斥了人类问题可能的多种分支概念，原则上应该归入一个基于普遍哲学原理的一个学科。

source: Different sciences require different axioms and admit of varying degrees of precision according to their subject.
zh_cn: 不同的学科需要不同的定理，并根据不同的学科承认不同的角度。

source: Thus Aristotle denied there could be exact laws of human nature, whilst maintaining that certain metaphysical categories - such as quantity, quality, substance and relation - were applicable to the description of all phenomena.
zh_cn: 因此，尽管维持著某些形上学范畴如数量、质量、实体和关系，以及适用于所有现象的描述，亚里斯多德仍然否认可以形成有关人性的确切法律。

source: If there is one common thread to much of Aristotle's work it lies in his conception of teleology, or purpose.
zh_cn: 如果亚里斯多德的著作中有一个共同的主轴的话，即是在于他的目的论这个概念。

source: Perhaps as a result of his preoccupation with biological studies, Aristotle was impressed by the idea that both animate and inanimate behaviour is directed toward some final purpose ('telos') or goal.
zh_cn: 或许由于他的专注于生物学的研究，亚里斯多德有一个印象深刻的概念是无论有生命和无生命的行为都会朝向一些最终目的(telos)前进。

source: It is common to explain the behaviour of people, institutions and nations in terms of purposes and goals (John is sitting the bar exam to become a barrister; the school is holding a f¨ºte to raise funds for the roof; the country is going to war to protect its territory), and likewise modern evolutionary biology makes use of purposive explanation to account for the behaviour of, for instance, genes and genetic imperatives.
zh_cn: 这常见于解释人类行为、制度、国家方面的目的（约翰正在准备律师资格考试，才能成为大律师；学校为了募集资金修理屋顶而举行宴会；这个国家走向战争，以保护其领土），同样地，现代进化生物学也利用目的去解释行为，例如基因和遗传的必要性。

source: However, Aristotle thought the concept of purpose could be invoked to explain the behaviour of everything in the universe.
zh_cn: 但是，亚里斯多德思想中的目的概念会被援引来解释宇宙中的一切行为。

source: His reasoning lay in the idea that everything has a natural function and strives towards fulfilling or exhibiting that function, which is its best and most natural state.
zh_cn: 他的概念会使任何事物都具有一个自然的功能和朝向目标实践的功能，这是它最好和最自然的状态。

source: It is by means of the concept of function that Aristotle then ties his ethics to his physics, claiming that the natural function of man is to reason, and to reason well is to reason in accordance with virtue.
zh_cn: 亚里斯多德凭著这个概念联结他的伦理学和物理学，主张人的天性是理性的，而最好的理性是理性与美德一致。

source: Unlike the opposing ethical theories of Kant and Mill, both of which view actions as the subject of ethical judgements, Aristotle's ethics focuses on the character of the agent as that which is morally good or morally bad.
zh_cn: 与反对道德理论的康德和弥尔不同，两人都把行为视为道德判断的主体，亚里斯多德的伦理学则侧重于作为道德善恶的媒介之性质。

source: This socalled 'virtue ethics' was revived with much critical success by Alistair Macintyre in late 20th century moral philosophy.
zh_cn: 这就是麦金太尔（Alistair Macintyre）在20世纪后期的道德哲学中所谓的“德性伦理”复兴与决定性的成功。
